me_list = ['Roman', 'Burnyshev', 35, 'Perm', 1986]
me_dict = {'name':'Roman', 'surname':'Burnyshev', 'age':35,'city':'Perm', 'born_age':1986}
print(me_list)
print(me_dict)


#На мой взгляд с точки зрения информации удобнее использовать словари. 
#Так как словарь позволяет получать нужные значения по определенному ключу и не потребуется запоминать индексы. Вспомнить в последствии запрос по ключу name проще, чем по индексу 0.
#Если в досье будет много цифр(рост, вес, год рождения и т.д.), то в списке не будет понимания, что они означают. В словаре же название ключа даст объяснение.